/**
 * Created by noonon on 6/12/16.
 */
module.exports = {
    '/api/data': {
        'data': [{
            'code': 'russian',
            'name': 'Россия',
            'cities': [{
                'code': 'moscow',
                'name': 'Москва',
                'places': [
                    {
                        'name': 'место 3',
                        'time': '24 часа',
                        'address': [
                            'место один',
                            'место два',
                            'место три'
                        ]
                    },
                    {
                        'name': 'место 2',
                        'time': '24 часа',
                        'address': [
                            'место один',
                            'место два',
                            'место три'
                        ]
                    }, {
                        'name': 'место 1',
                        'time': '24 часа',
                        'address': [
                            'место один'
                        ]
                    }]
            },
                {
                    'code': 'moscow',
                    'name': 'Москва',
                    'places': [
                        {
                            'name': 'место 1',
                            'time': '24 часа',
                            'address': [
                                'место один',
                                'место два',
                                'место три'
                            ]
                        },
                        {
                            'name': 'место 2',
                            'time': '24 часа',
                            'address': [
                                'место один',
                                'место два',
                                'место три'
                            ]
                        }, {
                            'name': 'место 3',
                            'time': '24 часа',
                            'address': [
                                'место три'
                            ]
                        }]
                }]
        },
            {
                'code': 'russian',
                'name': 'Россия',
                'cities': [{
                    'code': 'moscow',
                    'name': 'Москва',
                    'places': [
                        {
                            'name': 'место 3',
                            'time': '24 часа',
                            'address': [
                                'место один',
                                'место два',
                                'место три'
                            ]
                        },
                        {
                            'name': 'место 2',
                            'time': '24 часа',
                            'address': [
                                'место один',
                                'место два',
                                'место три'
                            ]
                        }, {
                            'name': 'место 1',
                            'time': '24 часа',
                            'address': [
                                'место один'
                            ]
                        }]
                },{
                    'code': 'moscow',
                    'name': 'Москва',
                    'places': [
                        {
                            'name': 'место 3',
                            'time': '24 часа',
                            'address': [
                                'место один',
                                'место два',
                                'место три'
                            ]
                        },
                        {
                            'name': 'место 2',
                            'time': '24 часа',
                            'address': [
                                'место один',
                                'место два',
                                'место три'
                            ]
                        }, {
                            'name': 'место 1',
                            'time': '24 часа',
                            'address': [
                                'место один'
                            ]
                        }]
                },
                    {
                        'code': 'moscow',
                        'name': 'Москва',
                        'places': [
                            {
                                'name': 'место 1',
                                'time': '24 часа',
                                'address': [
                                    'место один',
                                    'место два',
                                    'место три'
                                ]
                            },
                            {
                                'name': 'место 2',
                                'time': '24 часа',
                                'address': [
                                    'место один',
                                    'место два',
                                    'место три'
                                ]
                            }, {
                                'name': 'место 3',
                                'time': '24 часа',
                                'address': [
                                    'место три'
                                ]
                            }]
                    }]
            },{
                'code': 'russian',
                'name': 'Россия',
                'cities': [{
                    'code': 'moscow',
                    'name': 'Москва',
                    'places': [
                        {
                            'name': 'место 3',
                            'time': '24 часа',
                            'address': [
                                'место один',
                                'место два',
                                'место три'
                            ]
                        },
                        {
                            'name': 'место 2',
                            'time': '24 часа',
                            'address': [
                                'место один',
                                'место два',
                                'место три'
                            ]
                        }, {
                            'name': 'место 1',
                            'time': '24 часа',
                            'address': [
                                'место один'
                            ]
                        }]
                },
                    {
                        'code': 'moscow',
                        'name': 'Москва',
                        'places': [
                            {
                                'name': 'место 1',
                                'time': '24 часа',
                                'address': [
                                    'место один',
                                    'место два',
                                    'место три'
                                ]
                            },
                            {
                                'name': 'место 2',
                                'time': '24 часа',
                                'address': [
                                    'место один',
                                    'место два',
                                    'место три'
                                ]
                            }, {
                                'name': 'место 3',
                                'time': '24 часа',
                                'address': [
                                    'место три'
                                ]
                            }]
                    }]
            }],
        headers: {},
        code: 200,
        timeout: 0
    }
};